# RbsDistributionsysConfigParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsDistributionsysConfigParam Property
ParameterTypeId Class See Also
---
"Configuration"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsDistributionsysConfigParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsDistributionsysConfigParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsDistributionsysConfigParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace